tap "aquaproj/aqua"
tap "homebrew/bundle"
# Text processing scripting language
brew "awk"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Theme for zsh
brew "powerlevel10k"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Declarative CLI Version manager. Support Lazy Install and Sharable configuration mechanism named Registry. Switch versions seamlessly
brew "aquaproj/aqua/aqua"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Virtual monitor for screen sharing
cask "deskpad"
cask "font-hack-nerd-font"
# CLI to create, run, and deploy Slack apps
cask "slack-cli"
