tap "aquaproj/aqua"
tap "hashicorp/tap"
tap "homebrew/bundle"
# Declarative CLI Version manager
brew "aqua"
# Text processing scripting language
brew "awk"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Platform built on V8 to build network applications
brew "node"
# Theme for zsh
brew "powerlevel10k"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform
brew "hashicorp/tap/terraform"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Virtual monitor for screen sharing
cask "deskpad"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# CLI to create, run, and deploy Slack apps
cask "slack-cli"
# Open-source code editor
cask "visual-studio-code"
